const { FacultyMajors } = require("../../index.model")

module.exports = () => {
    return FacultyMajors.bulkCreate([
        {
            "id" : "43c74c9b-bab8-4ac6-9868-947be987ce81",
            "name" : "วิศวกรรมอุตสาหการ",
            "createdAt" : "2022-08-01T16:23:57.394Z",
            "updatedAt" : "2022-08-01T16:23:57.394Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "458e886b-fb2a-4bba-ac2d-be22972af6ea",
            "name" : "วิศวกรรมโลหการ",
            "createdAt" : "2022-08-01T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "5d89bd23-c419-4f72-8616-9d28d9c05a31",
            "name" : "วิศวกรรมโยธา",
            "createdAt" : "2022-08-01T16:46:20.461Z",
            "updatedAt" : "2022-08-01T16:46:20.461Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "fdb68540-657d-4f48-982d-a1bede135b59",
            "name" : "วิศวกรรมเครื่องกล",
            "createdAt" : "2022-08-02T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "fd6f215f-9c08-418d-851a-90148a2e7c0f",
            "name" : "วิศวกรรมเครื่องจักรกลเกษตร",
            "createdAt" : "2022-08-03T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "fd646f03-e2cc-4603-af9a-b55b46699e0a",
            "name" : "วิศวกรรมหลังการเก็บเกี่ยวและแปรสภาพ",
            "createdAt" : "2022-08-04T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "fb7c23f0-449f-47f1-a55e-caacd31c607b",
            "name" : "วิศวกรรมไฟฟ้า",
            "createdAt" : "2022-08-05T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "f40e1a0b-51e6-42a8-9be1-3f73dbd800b9",
            "name" : "วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม",
            "createdAt" : "2022-08-06T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "c2c73e36-374e-456a-9569-6666e43badcb",
            "name" : "วิศวกรรมคอมพิวเตอร์",
            "createdAt" : "2022-08-07T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "c27fc826-a613-49a0-954d-e375e8c99818",
            "name" : "วิศวกรรมเมคคาทรอนิกส์",
            "createdAt" : "2022-08-08T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "c083dea1-7d74-4f7b-91bc-0c797811d336",
            "name" : "เคมี",
            "createdAt" : "2022-08-09T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "be547c60-1602-4e20-9ed6-757f983984cb",
            "name" : "วิศวกรรมอุตสาหการ (เทียบโอน)",
            "createdAt" : "2022-08-09T16:40:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "bd7f09b6-6ffd-4ff2-ba79-724e38f4d61f",
            "name" : "วิศวกรรมโยธา (เทียบโอน)",
            "createdAt" : "2022-08-09T16:41:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "baada273-d788-431e-90c9-dfa8ff068146",
            "name" : "วิศวกรรมเครื่องกล (เทียบโอน)",
            "createdAt" : "2022-08-09T16:42:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "ba923115-bbb9-41e2-ae67-848d84b0e333",
            "name" : "วิศวกรรมเครื่องจักรกลเกษตร(เทียบโอน)",
            "createdAt" : "2022-08-09T16:43:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "b3ebd6a7-7445-4003-a580-ee1810a7f41b",
            "name" : "วิศวกรรมไฟฟ้า (เทียบโอน)",
            "createdAt" : "2022-08-09T16:44:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "aaf1e4e9-35ce-4dd1-8b51-a3f89c60da49",
            "name" : "วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม (เทียบโอน)",
            "createdAt" : "2022-08-09T16:45:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "a63f6828-2ce7-4cb3-92d2-9c35e811b268",
            "name" : "วิศวคอมพิวเตอร์ (เทียบโอน)",
            "createdAt" : "2022-08-09T16:46:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "a55b3444-2c62-45cc-b4dc-db116c82c452",
            "name" : "วิศวกรรมเครื่องกล (บัณฑิตศึกษา)",
            "createdAt" : "2022-08-09T16:47:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "a3c60fe9-3dba-4d97-ad15-e284372fc9cd",
            "name" : "วิศวกรรมโยธา (บัณฑิตศึกษา)",
            "createdAt" : "2022-08-09T16:48:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "a2fdfd79-0d03-451d-af6a-b6aedbc407c9",
            "name" : "วิศวกรรมไฟฟ้า (บัณฑิตศึกษา)",
            "createdAt" : "2022-08-09T16:50:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "f468ec6d-30a0-4e10-9dee-03fd0e70057a"
        },
        {
            "id" : "a20330c5-9eb6-422b-b2b2-28989473debe",
            "name" : "วิศวกรรมอุตสาหการ",
            "createdAt" : "2022-08-01T16:23:57.394Z",
            "updatedAt" : "2022-08-01T16:23:57.394Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "a1bc2a72-dbea-434f-93f3-a938c0daa2e2",
            "name" : "วิศวกรรมโยธา",
            "createdAt" : "2022-08-01T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "a0580928-666f-4a8e-a1d1-e70aa6d32d8a",
            "name" : "วิศวกรรมไฟฟ้า",
            "createdAt" : "2022-08-01T16:46:20.461Z",
            "updatedAt" : "2022-08-01T16:46:20.461Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "a04a19b6-6ff5-43fb-87dc-dd1ca246f259",
            "name" : "วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม",
            "createdAt" : "2022-08-02T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "9d2307f9-5ba7-4e40-8f8c-b384df902774",
            "name" : "วิศวกรรมการเชื่อม",
            "createdAt" : "2022-08-03T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "9cb08b66-0750-475d-ad11-a213338dbde0",
            "name" : "วิศวกรรมคอมพิวเตอร์",
            "createdAt" : "2022-08-04T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "9c047489-f124-4349-abc3-1798d0add0ba",
            "name" : "วิศวกรรมเครื่องกล",
            "createdAt" : "2022-08-05T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "9abb5c1f-6cff-43ff-a03e-8709d0da8346",
            "name" : "วิศวกรรมท่ออุตสาหกรรม",
            "createdAt" : "2022-08-06T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "9a3bf2a2-38b7-48ed-95ab-f0e645a14192",
            "name" : "ภาษาอังกฤษเพื่อการสื่อสารสากล",
            "createdAt" : "2022-08-07T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "96209b11-91a4-4cbd-865c-7ab5c7dbd7e8",
            "name" : "วิศวกรรมการเชื่อม (เทียบโอน)",
            "createdAt" : "2022-08-08T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "94c7588b-5e93-468d-964f-af203c6dbe31",
            "name" : "วิศวกรรมเครื่องกล (เทียบโอน)",
            "createdAt" : "2022-08-09T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "8f6ccd02-d11d-447a-833e-10664440280d",
            "name" : "วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม (เทียบโอน)",
            "createdAt" : "2022-08-09T16:40:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "8eba5a3d-7997-4642-8d62-0e0985aff2de",
            "name" : "เทคโนโลยีอุตสาหการ ต่อเนื่อง",
            "createdAt" : "2022-08-09T16:41:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "8e272a0b-3260-4e80-92b4-dfa43fff8fe2",
            "name" : "วิศวกรรมท่ออุคสาหกรรม ต่อเนื่อง",
            "createdAt" : "2022-08-09T16:42:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "8d4cc22b-566f-41c3-8025-8fa7c6d52215",
            "name" : "เทคโนโลยีออกแบบการผลิต ต่อเนื่อง",
            "createdAt" : "2022-08-09T16:43:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "8740c1c1-a225-4391-b0c7-97d624d5a72d",
            "name" : "ภาษาอังกฤษศึกษา",
            "createdAt" : "2022-08-09T16:44:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "8698be6d-2feb-4422-a770-f08574cc3d01",
            "name" : "วิชาวิศวกรรมไฟฟ้าศึกษา (บัณฑิตศึกษา)",
            "createdAt" : "2022-08-09T16:45:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "39ea1955-0183-424c-af42-5d51383ae1b6"
        },
        {
            "id" : "85be39ea-c528-4258-9555-547854a7cf29",
            "name" : "การจัดการนวัตกรรมทางธุรกิจ",
            "createdAt" : "2022-08-01T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "859c65bf-270c-4ed8-bb88-02dd0d09c2ec",
            "name" : "การตลาด",
            "createdAt" : "2022-08-01T16:46:20.461Z",
            "updatedAt" : "2022-08-01T16:46:20.461Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "8521b47d-5fbb-4071-98f0-5e4b9a6a1c88",
            "name" : "เทคโนโลยีธุรกิจดิจิทัล",
            "createdAt" : "2022-08-02T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "8308a4ce-889a-4b50-ab3a-0b6dd15b0202",
            "name" : "การบัญชี",
            "createdAt" : "2022-08-03T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "828c8005-a3c5-4c02-b673-93b5a5136d7f",
            "name" : "การตลาด (โครงการทุนบริษัท กลุ่มเซ็นทรัล จำกัด)",
            "createdAt" : "2022-08-04T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "80f4fdba-5484-484d-baa2-0ae725525a20",
            "name" : "การจัดการนวัตกรรมการค้า (ความร่วมมือทางวิชาการ บริษัท ซีพีออล์ล จำกัด)",
            "createdAt" : "2022-08-05T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "8000484a-7b9d-4135-99c8-6c8d2798b54e",
            "name" : "การจัดการโลจิสติกส์",
            "createdAt" : "2022-08-06T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "7e3a3e89-1459-4591-83c8-6e4edadebb69",
            "name" : "สตาร์ทอัพการท่องเที่ยวและการบริการ",
            "createdAt" : "2022-08-07T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "7cf3c1bf-be75-4bd9-a37a-046a2629d2a2",
            "name" : "การจัดการธุรกิจบูรณาการภาษา",
            "createdAt" : "2022-08-08T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "7cbbfe5d-d6d0-4731-a900-2599c52c821e",
            "name" : "การบริหารธุรกิจแบบบูรณาการ",
            "createdAt" : "2022-08-09T16:39:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "7ba0f87d-d974-4876-9adb-fdbc10b250db",
            "name" : "การจัดการนวัตกรรมทางธุรกิจ (เทียบโอน)",
            "createdAt" : "2022-08-09T16:40:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "7ae043b8-7d5c-4828-8961-eea2f4d155a7",
            "name" : "การตลาด (เทียบโอน)",
            "createdAt" : "2022-08-09T16:41:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "787df559-141e-43ab-a202-ca1f15363bb2",
            "name" : "เทคโนโลยีธุรกิจดิจิทัล (เทียบโอน)",
            "createdAt" : "2022-08-09T16:42:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "7565335a-e2a5-4617-a71a-ccb9dadec65a",
            "name" : "บัญชี (เทียบโอน)",
            "createdAt" : "2022-08-09T16:43:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "74937578-e20a-45bd-8eb4-c8dd5567e10e",
            "name" : "การจัดการโลจิสติกส์ (เทียบโอน)",
            "createdAt" : "2022-08-09T16:44:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "730f08d6-c916-4b4a-bc8d-32a12490d1b6",
            "name" : "สตาร์ทอัพการท่องเที่ยวและการบริการ (เทียบโอน)",
            "createdAt" : "2022-08-09T16:45:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "675aea0a-965c-427b-93b0-5df3eeae7f91",
            "name" : "การเป็นผู้ประกอบการและนวัตกรรมทางธุรกิจ (บัณฑิตศึกษา)",
            "createdAt" : "2022-08-09T16:46:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
        {
            "id" : "6739cc1e-c7b8-40dc-ab50-283779dac117",
            "name" : "บัญชี (บัณฑิตศึกษา)",
            "createdAt" : "2022-08-09T16:47:24.823Z",
            "updatedAt" : "2022-08-01T16:41:22.082Z",
            "facultyId" : "3c2e9079-fe20-44e9-ad44-6ea2c3d95deb"
        },
    ])
}