const { AssessmentConditions } = require("../../index.model");

module.exports = () => {
  return AssessmentConditions.bulkCreate([
    {
      id: "beeffb18-9fda-44f5-92ef-db77b81b0176",
      description: "1. ด้านเนื้อหาการจัดทำโครงการ",
      examinations:
        [{"description":"1.1 ท่านคาดหวังจะได้รับความรู้จากการจัดโครงการ มากน้อยเพียงใด"},{"description":"1.2 หลังการเข้าร่วมการจัดโครงการ ท่านได้รับความรู้และประโยชน์มากน้อยเพียงใด"},{"description":"1.3 เนื้อหาในการจัดโครงการครั้งนี้มีมากน้อยเพียงใด"},{"description":"1.4 ระยะเวลาในการจัดโครงการ มีความเหมาะสมมากน้อยเพียงใด"},{"description":"1.5 เทคนิคและวิธีการจัดโครงการ มีความเหมาะสมมากน้อยเพียงใด"},{"description":"1.6 การจัดโครงการครั้งนี้ ท่านสามารถนำไปใช้ประโยชน์ในงานของท่านมากน้อยเพียงใด"}],
      createdAt: "2022-08-16T10:22:54.868Z",
      updatedAt: "2022-08-16T10:22:54.868Z",
      assessmentId: "5fab692d-b214-4063-b4fd-d9e353447fbc",
    },
    {
      id: "e3927bb3-d61d-43b2-a421-bbeb83c244f2",
      description: "2. ด้านวิทยาการในการบรรยาย",
      examinations:
        [{"description":"2.1 ความรู้เนื้อหาที่บรรยาย"},{"description":"2.2 การถ่ายทอดเนื้อหาและการสร้างบรรยากาศในการบรรยายน่าสนใจ"},{"description":"2.3 ความสามารถในการถ่ายทอดความรู้ให้ผู้ฟังเข้าใจ"},{"description":"2.4 การบรรยายครอบคลุมเนื้อหาที่กำหนดและตรงประเด็น"},{"description":"2.5ความสามารถในการตอบข้อซักถามจากผู้เข้าร่วมโครงการ"}],
      createdAt: "2022-08-16T10:22:54.868Z",
      updatedAt: "2022-08-16T10:22:54.868Z",
      assessmentId: "5fab692d-b214-4063-b4fd-d9e353447fbc",
    },
    {
      id: "a55fb57f-47d6-4807-9e08-471cf8dc72cb",
      description: "3. ด้านความรู้ที่ได้รับจากการจัดโครงงาน",
      examinations:
        [{"description":"3.1.1 แนวทางเกี่ยวกับเรื่อง 1 - 32 ที่ท่านเข้าร่วมการแข่งขัน (ก่อนเข้าร่วม)"},{"description":"3.1.2 แนวทางการแก้ปัญหาจากการแข่งขัน (ก่อนเข้าร่วม)"},{"description":"3.1.3 การพัฒนาเกี่ยวกับเรื่อง 1 - 32 ที่้่ท่านเข้าร่วมแข่งขัน (ก่อนเข้าร่วม)"},{"description":"3.1.4 แนวทางเกี่ยวกับเรื่อง 1 - 32 ที่ท่านเข้าร่วมการแข่งขัน (หลังเข้าร่วม)"},{"description":"3.1.5 แนวทางการแก้ปัญหาจากการแข่งขัน (ก่อนเข้าร่วม)"},{"description":"3.1.6 การพัฒนาเกี่ยวกับเรื่อง 1 - 32 ที่้่ท่านเข้าร่วมแข่งขัน (ก่อนเข้าร่วม)"}],
      createdAt: "2022-08-16T10:22:54.868Z",
      updatedAt: "2022-08-16T10:22:54.868Z",
      assessmentId: "5fab692d-b214-4063-b4fd-d9e353447fbc",
    },
    {
      id: "cb733a21-447b-49a7-953d-28078aebd0d0",
      description: "4. ด้านการบริหารจัดการในการเข้าร่วมโครงการ",
      examinations:
        [{"description":"4.1 เอกสารประกอบการจัดโครงการ"},{"description":"4.2 คุณภาพและความเหมาะสมของโสตทัศนูปกรณ์"},{"description":"4.3 การต้อนรับและการบริการ"},{"description":"4.4 สถานที่อบรมสัมมนา"},{"description":"4.5 ความพึงพอใจในภาพรวม"}],
      createdAt: "2022-08-16T10:22:54.869Z",
      updatedAt: "2022-08-16T10:22:54.869Z",
      assessmentId: "5fab692d-b214-4063-b4fd-d9e353447fbc",
    },
  ]);
};
